susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32F417.h
/*
 * This file is automatically generated by afTable.py from the xml descriptions provided as part of the STM32Cube IDE
 * Timestamp: 2023-12-12T18:58:56.192295
 */

#ifndef LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION
#define LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION

#define CAN1_RX_PA11_ PA11,GPIO_AF9
#define CAN1_RX_PB8_ PB8,GPIO_AF9
#define CAN1_RX_PD0_ PD0,GPIO_AF9
#define CAN1_RX_PI9_ PI9,GPIO_AF9
#define _CAN1_RX_PA11_ 1
#define _CAN1_RX_PB8_ 1
#define _CAN1_RX_PD0_ 1
#define _CAN1_RX_PI9_ 1

#define CAN1_TX_PA12_ PA12,GPIO_AF9
#define CAN1_TX_PB9_ PB9,GPIO_AF9
#define CAN1_TX_PD1_ PD1,GPIO_AF9
#define CAN1_TX_PH13_ PH13,GPIO_AF9
#define _CAN1_TX_PA12_ 1
#define _CAN1_TX_PB9_ 1
#define _CAN1_TX_PD1_ 1
#define _CAN1_TX_PH13_ 1

#define CAN2_RX_PB12_ PB12,GPIO_AF9
#define CAN2_RX_PB5_ PB5,GPIO_AF9
#define _CAN2_RX_PB12_ 1
#define _CAN2_RX_PB5_ 1

#define CAN2_TX_PB13_ PB13,GPIO_AF9
#define CAN2_TX_PB6_ PB6,GPIO_AF9
#define _CAN2_TX_PB13_ 1
#define _CAN2_TX_PB6_ 1

#define DCMI_D0_PA9_ PA9,GPIO_AF13
#define DCMI_D0_PC6_ PC6,GPIO_AF13
#define DCMI_D0_PH9_ PH9,GPIO_AF13
#define _DCMI_D0_PA9_ 1
#define _DCMI_D0_PC6_ 1
#define _DCMI_D0_PH9_ 1

#define DCMI_D1_PA10_ PA10,GPIO_AF13
#define DCMI_D1_PC7_ PC7,GPIO_AF13
#define DCMI_D1_PH10_ PH10,GPIO_AF13
#define _DCMI_D1_PA10_ 1
#define _DCMI_D1_PC7_ 1
#define _DCMI_D1_PH10_ 1

#define DCMI_D10_PB5_ PB5,GPIO_AF13
#define DCMI_D10_PI3_ PI3,GPIO_AF13
#define _DCMI_D10_PB5_ 1
#define _DCMI_D10_PI3_ 1

#define DCMI_D11_PD2_ PD2,GPIO_AF13
#define DCMI_D11_PH15_ PH15,GPIO_AF13
#define _DCMI_D11_PD2_ 1
#define _DCMI_D11_PH15_ 1

#define DCMI_D12_PF11_ PF11,GPIO_AF13
#define _DCMI_D12_PF11_ 1

#define DCMI_D13_PG15_ PG15,GPIO_AF13
#define DCMI_D13_PI0_ PI0,GPIO_AF13
#define _DCMI_D13_PG15_ 1
#define _DCMI_D13_PI0_ 1

#define DCMI_D2_PC8_ PC8,GPIO_AF13
#define DCMI_D2_PE0_ PE0,GPIO_AF13
#define DCMI_D2_PH11_ PH11,GPIO_AF13
#define _DCMI_D2_PC8_ 1
#define _DCMI_D2_PE0_ 1
#define _DCMI_D2_PH11_ 1

#define DCMI_D3_PC9_ PC9,GPIO_AF13
#define DCMI_D3_PE1_ PE1,GPIO_AF13
#define DCMI_D3_PH12_ PH12,GPIO_AF13
#define _DCMI_D3_PC9_ 1
#define _DCMI_D3_PE1_ 1
#define _DCMI_D3_PH12_ 1

#define DCMI_D4_PC11_ PC11,GPIO_AF13
#define DCMI_D4_PE4_ PE4,GPIO_AF13
#define DCMI_D4_PH14_ PH14,GPIO_AF13
#define _DCMI_D4_PC11_ 1
#define _DCMI_D4_PE4_ 1
#define _DCMI_D4_PH14_ 1

#define DCMI_D5_PB6_ PB6,GPIO_AF13
#define DCMI_D5_PI4_ PI4,GPIO_AF13
#define _DCMI_D5_PB6_ 1
#define _DCMI_D5_PI4_ 1

#define DCMI_D6_PB8_ PB8,GPIO_AF13
#define DCMI_D6_PE5_ PE5,GPIO_AF13
#define DCMI_D6_PI6_ PI6,GPIO_AF13
#define _DCMI_D6_PB8_ 1
#define _DCMI_D6_PE5_ 1
#define _DCMI_D6_PI6_ 1

#define DCMI_D7_PB9_ PB9,GPIO_AF13
#define DCMI_D7_PE6_ PE6,GPIO_AF13
#define DCMI_D7_PI7_ PI7,GPIO_AF13
#define _DCMI_D7_PB9_ 1
#define _DCMI_D7_PE6_ 1
#define _DCMI_D7_PI7_ 1

#define DCMI_D8_PC10_ PC10,GPIO_AF13
#define DCMI_D8_PI1_ PI1,GPIO_AF13
#define _DCMI_D8_PC10_ 1
#define _DCMI_D8_PI1_ 1

#define DCMI_D9_PC12_ PC12,GPIO_AF13
#define DCMI_D9_PI2_ PI2,GPIO_AF13
#define _DCMI_D9_PC12_ 1
#define _DCMI_D9_PI2_ 1

#define DCMI_HSYNC_PA4_ PA4,GPIO_AF13
#define DCMI_HSYNC_PH8_ PH8,GPIO_AF13
#define _DCMI_HSYNC_PA4_ 1
#define _DCMI_HSYNC_PH8_ 1

#define DCMI_PIXCLK_PA6_ PA6,GPIO_AF13
#define _DCMI_PIXCLK_PA6_ 1

#define DCMI_VSYNC_PB7_ PB7,GPIO_AF13
#define DCMI_VSYNC_PI5_ PI5,GPIO_AF13
#define _DCMI_VSYNC_PB7_ 1
#define _DCMI_VSYNC_PI5_ 1

#define ETH_COL_PA3_ PA3,GPIO_AF11
#define ETH_COL_PH3_ PH3,GPIO_AF11
#define _ETH_COL_PA3_ 1
#define _ETH_COL_PH3_ 1

#define ETH_CRS_PA0_ PA0,GPIO_AF11
#define ETH_CRS_PH2_ PH2,GPIO_AF11
#define _ETH_CRS_PA0_ 1
#define _ETH_CRS_PH2_ 1

#define ETH_CRS_DV_PA7_ PA7,GPIO_AF11
#define _ETH_CRS_DV_PA7_ 1

#define ETH_MDC_PC1_ PC1,GPIO_AF11
#define _ETH_MDC_PC1_ 1

#define ETH_MDIO_PA2_ PA2,GPIO_AF11
#define _ETH_MDIO_PA2_ 1

#define ETH_PPS_OUT_PB5_ PB5,GPIO_AF11
#define ETH_PPS_OUT_PG8_ PG8,GPIO_AF11
#define _ETH_PPS_OUT_PB5_ 1
#define _ETH_PPS_OUT_PG8_ 1

#define ETH_REF_CLK_PA1_ PA1,GPIO_AF11
#define _ETH_REF_CLK_PA1_ 1

#define ETH_RXD0_PC4_ PC4,GPIO_AF11
#define _ETH_RXD0_PC4_ 1

#define ETH_RXD1_PC5_ PC5,GPIO_AF11
#define _ETH_RXD1_PC5_ 1

#define ETH_RXD2_PB0_ PB0,GPIO_AF11
#define ETH_RXD2_PH6_ PH6,GPIO_AF11
#define _ETH_RXD2_PB0_ 1
#define _ETH_RXD2_PH6_ 1

#define ETH_RXD3_PB1_ PB1,GPIO_AF11
#define ETH_RXD3_PH7_ PH7,GPIO_AF11
#define _ETH_RXD3_PB1_ 1
#define _ETH_RXD3_PH7_ 1

#define ETH_RX_CLK_PA1_ PA1,GPIO_AF11
#define _ETH_RX_CLK_PA1_ 1

#define ETH_RX_DV_PA7_ PA7,GPIO_AF11
#define _ETH_RX_DV_PA7_ 1

#define ETH_RX_ER_PB10_ PB10,GPIO_AF11
#define ETH_RX_ER_PI10_ PI10,GPIO_AF11
#define _ETH_RX_ER_PB10_ 1
#define _ETH_RX_ER_PI10_ 1

#define ETH_TXD0_PB12_ PB12,GPIO_AF11
#define ETH_TXD0_PG13_ PG13,GPIO_AF11
#define _ETH_TXD0_PB12_ 1
#define _ETH_TXD0_PG13_ 1

#define ETH_TXD1_PB13_ PB13,GPIO_AF11
#define ETH_TXD1_PG14_ PG14,GPIO_AF11
#define _ETH_TXD1_PB13_ 1
#define _ETH_TXD1_PG14_ 1

#define ETH_TXD2_PC2_ PC2,GPIO_AF11
#define _ETH_TXD2_PC2_ 1

#define ETH_TXD3_PB8_ PB8,GPIO_AF11
#define ETH_TXD3_PE2_ PE2,GPIO_AF11
#define _ETH_TXD3_PB8_ 1
#define _ETH_TXD3_PE2_ 1

#define ETH_TX_CLK_PC3_ PC3,GPIO_AF11
#define _ETH_TX_CLK_PC3_ 1

#define ETH_TX_EN_PB11_ PB11,GPIO_AF11
#define ETH_TX_EN_PG11_ PG11,GPIO_AF11
#define _ETH_TX_EN_PB11_ 1
#define _ETH_TX_EN_PG11_ 1

#define FSMC_A0_PF0_ PF0,GPIO_AF12
#define _FSMC_A0_PF0_ 1

#define FSMC_A1_PF1_ PF1,GPIO_AF12
#define _FSMC_A1_PF1_ 1

#define FSMC_A10_PG0_ PG0,GPIO_AF12
#define _FSMC_A10_PG0_ 1

#define FSMC_A11_PG1_ PG1,GPIO_AF12
#define _FSMC_A11_PG1_ 1

#define FSMC_A12_PG2_ PG2,GPIO_AF12
#define _FSMC_A12_PG2_ 1

#define FSMC_A13_PG3_ PG3,GPIO_AF12
#define _FSMC_A13_PG3_ 1

#define FSMC_A14_PG4_ PG4,GPIO_AF12
#define _FSMC_A14_PG4_ 1

#define FSMC_A15_PG5_ PG5,GPIO_AF12
#define _FSMC_A15_PG5_ 1

#define FSMC_A16_PD11_ PD11,GPIO_AF12
#define _FSMC_A16_PD11_ 1

#define FSMC_A17_PD12_ PD12,GPIO_AF12
#define _FSMC_A17_PD12_ 1

#define FSMC_A18_PD13_ PD13,GPIO_AF12
#define _FSMC_A18_PD13_ 1

#define FSMC_A19_PE3_ PE3,GPIO_AF12
#define _FSMC_A19_PE3_ 1

#define FSMC_A2_PF2_ PF2,GPIO_AF12
#define _FSMC_A2_PF2_ 1

